released/M031BSP_INT_PWM_ADC_KEILv5/SampleCode/Template/main.c
/*_____ I N C L U D E S ____________________________________________________*/
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"

#include "misc_config.h"

#include "timer_service.h"

#include "app_eint_capture.h"
#include "app_rpm_capture.h"

#include "app_emulate_signal.h"
/*_____ D E C L A R A T I O N S ____________________________________________*/

volatile struct flag_32bit flag_PROJ_CTL;
#define FLAG_PROJ_TIMER_PERIOD_1000MS                 	(flag_PROJ_CTL.bit0)
#define FLAG_PROJ_ADC_DATA_READY               			(flag_PROJ_CTL.bit1)
#define FLAG_PROJ_PWM_DUTY_INC             				(flag_PROJ_CTL.bit2)
#define FLAG_PROJ_PWM_DUTY_DEC                          (flag_PROJ_CTL.bit3)
#define FLAG_PROJ_RPM_INC                               (flag_PROJ_CTL.bit4)
#define FLAG_PROJ_RPM_DEC                               (flag_PROJ_CTL.bit5)
#define FLAG_PROJ_REVERSE6                              (flag_PROJ_CTL.bit6)
#define FLAG_PROJ_REVERSE7                              (flag_PROJ_CTL.bit7)


/*_____ D E F I N I T I O N S ______________________________________________*/
volatile uint32_t g_u32SysTickMs = 0UL;

volatile unsigned long counter_systick = 0;
volatile uint32_t counter_tick = 0;
// timer task
static int g_timer_id_task1 = -1;
static int g_timer_id_task2 = -1;
static int g_timer_id_task3 = -1;

enum
{
	ADC0_CH0 = 0 ,
	ADC0_CH1 , 	
	ADC0_CH2 , 
	ADC0_CH3 , 
	ADC0_CH4 , 
	
	ADC0_CH5 , 
	ADC0_CH6 , 
	ADC0_CH7 , 
	ADC0_CH8 , 
	ADC0_CH9 , 
	
	ADC0_CH10 , 
	ADC0_CH11 , 
	ADC0_CH12 ,
	ADC0_CH13 , 
	ADC0_CH14 , 
	ADC0_CH15 , 
	
	ADC_CH_DEFAULT 	
}ADC_CH_TypeDef;

typedef struct
{	
	uint8_t ch; 
	uint16_t data;
}ADC_struct;

enum{
	State_avergage = 0 ,
	State_moving ,		
	
	State_DEFAULT	
}ADC_State;

volatile ADC_struct adc_measure[] =
{
	{ADC0_CH6,0},
	{ADC0_CH7,0},

	{ADC_CH_DEFAULT,0},	
};

enum
{
    TARGET_CH_0,
    TARGET_CH_1,
};

// #define ADC_RESOLUTION							((uint16_t)(4096u))
#define ADC_MAX_CODE                             (4095UL)
#define ADC_CALC_DATA_TO_VOLTAGE(DATA, VREF_MV)  \
    (((uint32_t)(DATA) * (uint32_t)(VREF_MV) + (ADC_MAX_CODE / 2UL)) / ADC_MAX_CODE)

#define ADCextendSampling 						(10)

#define ADC_AVG_TRAGET 						    (8)
#define ADC_AVG_POW	 					        (3)
#define ADC_CH_NUM	 						    (2)
#define ADC_WAIT_READY_TIMEOUT_COUNT             (0xFFFFU)

volatile uint16_t adc_temporay_ch = 0;
volatile uint16_t adc_temporay_raw = 0;
uint32_t AVdd = 0;
volatile uint32_t g_u32AdcTimeoutTotal = 0U;
volatile uint32_t g_u32AdcTimeoutAverage = 0U;
volatile uint32_t g_u32AdcTimeoutMoving = 0U;

/*_____ M A C R O S ________________________________________________________*/

/*_____ F U N C T I O N S __________________________________________________*/

unsigned long get_systick(void)
{
	return (counter_systick);
}

void set_systick(unsigned long t)
{
	counter_systick = t;
}

void systick_counter(void)
{
	counter_systick++;
}

void SysTick_Handler(void)
{

    systick_counter();

    // if ((get_systick() % 1000) == 0)
    // {
       
    // }

    #if defined (ENABLE_TICK_EVENT)
    TickCheckTickEvent();
    #endif    

    g_u32SysTickMs++;   // for capture
}

void SysTick_delay(unsigned long delay)
{  
    
    unsigned long tickstart = get_systick(); 
    unsigned long wait = delay; 

    while((get_systick() - tickstart) < wait) 
    { 
    } 

}

void SysTick_enable(unsigned long ticks_per_second)
{
    set_systick(0);
    if (SysTick_Config(SystemCoreClock / ticks_per_second))
    {
        /* Setup SysTick Timer for 1 second interrupts  */
        printf("Set system tick error!!\n");
        while (1);
    }

    #if defined (ENABLE_TICK_EVENT)
    TickInitTickEvent();
    #endif
}

uint32_t get_tick(void)
{
	return (counter_tick);
}

void set_tick(uint32_t t)
{
	counter_tick = t;
}

void tick_counter(void)
{
	counter_tick++;
}

void delay_ms(uint16_t ms)
{
	#if 1
	uint32_t start = get_tick();
    while ((uint32_t)(get_tick() - start) < (uint32_t)ms) 
	{
		
	}	
	#else
	TIMER_Delay(TIMER0, 1000*ms);
	#endif
}


__STATIC_INLINE uint32_t FMC_ReadBandGap(void)
{
    FMC->ISPCMD = FMC_ISPCMD_READ_UID;            /* Set ISP Command Code */
    FMC->ISPADDR = 0x70u;                         /* Must keep 0x70 when read Band-Gap */
    FMC->ISPTRG = FMC_ISPTRG_ISPGO_Msk;           /* Trigger to start ISP procedure */
#if ISBEN
    __ISB();
#endif                                            /* To make sure ISP/CPU be Synchronized */
    while(FMC->ISPTRG & FMC_ISPTRG_ISPGO_Msk) {}  /* Waiting for ISP Done */

    return FMC->ISPDAT & 0xFFF;
}

// void convertDecToBin(int n)
// {
//     int k = 0;
//     unsigned char *p = (unsigned char*)&n;
//     int val2 = 0;
//     int i = 0;
//     for(k = 0; k <= 1; k++)
//     {
//         val2 = *(p+k);
//         for (i = 7; i >= 0; i--)
//         {
//             if(val2 & (1 << i))
//                 printf("1");
//             else
//                 printf("0");
//         }
//         printf(" ");
//     }
// }


void ADC_IRQHandler(void)
{
	FLAG_PROJ_ADC_DATA_READY = 1;
	adc_temporay_raw = ADC_GET_CONVERSION_DATA(ADC, adc_temporay_ch);	
    ADC_CLR_INT_FLAG(ADC, ADC_ADF_INT); /* Clear the A/D interrupt flag */
}

void ADC_ReadAVdd(void)
{
    uint32_t u32ConversionData;
    uint32_t u32BuiltInData;
    uint32_t u32Timeout = ADC_WAIT_READY_TIMEOUT_COUNT;

    ADC_POWER_ON(ADC);
    CLK_SysTickDelay(10000);
	
    ADC_Open(ADC, ADC_ADCR_DIFFEN_SINGLE_END, ADC_ADCR_ADMD_SINGLE, BIT29);
    ADC_SetExtendSampleTime(ADC, 0, 71);
    ADC_CLR_INT_FLAG(ADC, ADC_ADF_INT);
    ADC_START_CONV(ADC);

    while ((ADC_GET_INT_FLAG(ADC, ADC_ADF_INT) == 0UL) && (u32Timeout > 0UL))
    {
        u32Timeout--;
    }

    if (u32Timeout == 0UL)
    {
        AVdd = 0UL;
        printf("%s : timeout\r\n", __FUNCTION__);
        return;
    }

    u32ConversionData = ADC_GET_CONVERSION_DATA(ADC, 29);
    ADC_CLR_INT_FLAG(ADC, ADC_ADF_INT);

    if (u32ConversionData == 0UL)
    {
        AVdd = 0UL;
        printf("%s : invalid conversion data\r\n", __FUNCTION__);
        return;
    }

    SYS_UnlockReg();
    FMC_Open();
    u32BuiltInData = FMC_ReadBandGap();	

	AVdd = (3072UL * u32BuiltInData + (u32ConversionData / 2UL)) / u32ConversionData;

	printf("%s : AVdd=%lumV, conv=%lu, bandgap=%lu\r\n",
           __FUNCTION__,
           (unsigned long)AVdd,
           (unsigned long)u32ConversionData,
           (unsigned long)u32BuiltInData);
	
