released/M031BSP_INT_PWM_ADC_KEILv5/SampleCode/Template/main.c
}

void ADC_InitChannel(uint8_t ch)
{
	FLAG_PROJ_ADC_DATA_READY = 0;

//	ADC_ReadAVdd();

    /* Enable ADC converter */
//    ADC_POWER_ON(ADC);

    /*Wait for ADC internal power ready*/
//    CLK_SysTickDelay(10000);

    /* Set input mode as single-end, and Single mode*/
    ADC_Open(ADC, ADC_ADCR_DIFFEN_SINGLE_END, ADC_ADCR_ADMD_SINGLE,(uint32_t) 0x1 << ch);

    /* To sample band-gap precisely, the ADC capacitor must be charged at least 3 us for charging the ADC capacitor ( Cin )*/
    /* Sampling time = extended sampling time + 1 */
    /* 1/24000000 * (Sampling time) = 3 us */
	/*
	    printf("+----------------------------------------------------------------------+\n");
	    printf("|   ADC clock source -> PCLK1  = 48 MHz                                |\n");
	    printf("|   ADC clock divider          = 2                                     |\n");
	    printf("|   ADC clock                  = 48 MHz / 2 = 24 MHz                   |\n");
	    printf("|   ADC extended sampling time = 71                                    |\n");
	    printf("|   ADC conversion time = 17 + ADC extended sampling time = 88         |\n");
	    printf("|   ADC conversion rate = 24 MHz / 88 = 272.7 ksps                     |\n");
	    printf("+----------------------------------------------------------------------+\n");
	*/

    /* Set extend sampling time based on external resistor value.*/
    ADC_SetExtendSampleTime(ADC,(uint32_t) NULL, ADCextendSampling);

    /* Select ADC input channel */
    ADC_SET_INPUT_CHANNEL(ADC, 0x1 << ch);

	ADC_CLR_INT_FLAG(ADC, ADC_ADF_INT);
	ADC_ENABLE_INT(ADC, ADC_ADF_INT);
	NVIC_EnableIRQ(ADC_IRQn);

    /* Start ADC conversion */
    ADC_START_CONV(ADC);
	
}

__STATIC_INLINE uint8_t ADC_WaitReadyWithTimeout(uint16_t u16TimeoutCount)
{
    while (!FLAG_PROJ_ADC_DATA_READY)
    {
        if (u16TimeoutCount == 0U)
        {
            return 0U;
        }
        u16TimeoutCount--;
    }

    return 1U;
}

void ADC_Process(uint8_t state)
{
	uint8_t idx = 0;
    uint8_t u8Timeout = 0U;
	volatile uint32_t sum = 0;
	uint16_t tmp = 0;
	
	switch(state)
	{
		case State_avergage:	
			for ( idx = 0 ; idx < ADC_CH_NUM ; idx++)
			{
                u8Timeout = 0U;
                adc_temporay_ch = adc_measure[idx].ch;
				for ( tmp = 0 ; tmp < ADC_AVG_TRAGET ; tmp++)
				{
					ADC_InitChannel(adc_temporay_ch);
                    if (ADC_WaitReadyWithTimeout(ADC_WAIT_READY_TIMEOUT_COUNT) == 0U)
                    {
                        g_u32AdcTimeoutTotal++;
                        g_u32AdcTimeoutAverage++;
                        u8Timeout = 1U;
                        ADC_DISABLE_INT(ADC, ADC_ADF_INT);
                        break;
                    }
					ADC_DISABLE_INT(ADC, ADC_ADF_INT);

					sum += adc_temporay_raw;									    //sum the first 8 ADC data
				}
                if (u8Timeout == 0U)
                {
				    adc_measure[idx].data = (uint16_t) (sum >> ADC_AVG_POW);			//do average
                }
                sum = 0;
			}

			break;

		case State_moving:
			for ( idx = 0 ; idx < ADC_CH_NUM ; idx++)
			{
                adc_temporay_ch = adc_measure[idx].ch;
                ADC_InitChannel(adc_temporay_ch);
                if (ADC_WaitReadyWithTimeout(ADC_WAIT_READY_TIMEOUT_COUNT) == 0U)
                {
                    g_u32AdcTimeoutTotal++;
                    g_u32AdcTimeoutMoving++;
                    ADC_DISABLE_INT(ADC, ADC_ADF_INT);
                    continue;
                }
				ADC_DISABLE_INT(ADC, ADC_ADF_INT);

				sum = adc_measure[idx].data << ADC_AVG_POW;					    //extend the original average data
				sum -= adc_measure[idx].data;									//subtract the old average data
				sum += adc_temporay_raw;									    //add the new adc data
				adc_measure[idx].data = (uint16_t) (sum >> ADC_AVG_POW);		//do average again
			}
			
			break;	
	}	
}

void ADC_log(void)
{
	uint16_t tmp = 0;
	uint8_t idx = 0;

    #if 1	// debug
    printf("AVdd:%4lumv-",(unsigned long)AVdd);
    for ( idx = 0 ; idx < ADC_CH_NUM ; idx++)
    {
        tmp = adc_measure[idx].data;

        printf("[%d]0x%03X,%4lumv,",
               idx,
               tmp,
               (unsigned long)ADC_CALC_DATA_TO_VOLTAGE(tmp, AVdd));
        
        if (idx == (ADC_CH_NUM -1) )
        {
            printf("\r\n");
        }				
    }
    #endif
}

void Task_1000ms_Callback(void *user_data)
{
	// static uint32_t LOG1 = 0;

    // printf("%s(timer) : %4d\r\n",__FUNCTION__,LOG1++);
    (void)user_data;
    PB14 ^= 1;
    // ADC_log();
    // RPM_Capture_Log();
}

void Task_100ms_Callback(void *user_data)
{
    (void)user_data;

}

void Task_10ms_Callback(void *user_data)
{
    (void)user_data;
    /*
        TARGET_CH_0    - PB6 (ADC0_CH6)   
        TARGET_CH_1    - PB7 (ADC0_CH7) 
    */
	ADC_Process(State_moving);
}

void TimerService_CreateTask(void)
{
    /* Create task1 timer: 10 ms */
    g_timer_id_task1 = TimerService_CreateTimer(10U, Task_10ms_Callback, (void *)0);

    /* Start timers */
    if (g_timer_id_task1 >= 0)
    {
        TimerService_StartTimer((unsigned int)g_timer_id_task1);
        printf("task1 id = %d\r\n", g_timer_id_task1);
    }

    /* Create task2 timer: 100 ms */
    g_timer_id_task2 = TimerService_CreateTimer(100U, Task_100ms_Callback, (void *)0);

    /* Start timers */
    if (g_timer_id_task2 >= 0)
    {
        TimerService_StartTimer((unsigned int)g_timer_id_task2);
        printf("task2 id = %d\r\n", g_timer_id_task2);
    }

    /* Create task3 timer: 1000 ms */
    g_timer_id_task3 = TimerService_CreateTimer(1000U, Task_1000ms_Callback, (void *)0);

    /* Start timers */
    if (g_timer_id_task3 >= 0)
    {
        TimerService_StartTimer((unsigned int)g_timer_id_task3);
        printf("task3 id = %d\r\n", g_timer_id_task3);
    }
}

//
// check_reset_source
//
uint8_t check_reset_source(void)
{
    uint32_t src = SYS_GetResetSrc();

    SYS->RSTSTS |= 0x1FF;
    printf("Reset Source <0x%08X>\r\n", src);

    #if 1   //DEBUG , list reset source
    if (src & BIT0)
    {
        printf("0)POR Reset Flag\r\n");       
    }
    if (src & BIT1)
    {
        printf("1)NRESET Pin Reset Flag\r\n");       
    }
    if (src & BIT2)
    {
        printf("2)WDT Reset Flag\r\n");       
    }
    if (src & BIT3)
    {
        printf("3)LVR Reset Flag\r\n");       
    }
    if (src & BIT4)
    {
        printf("4)BOD Reset Flag\r\n");       
    }
    if (src & BIT5)
    {
        printf("5)System Reset Flag \r\n");       
    }
    if (src & BIT6)
    {
        printf("6)Reserved.\r\n");       
    }
    if (src & BIT7)
    {
        printf("7)CPU Reset Flag\r\n");       
    }
    if (src & BIT8)
    {
        printf("8)CPU Lockup Reset Flag\r\n");       
    }
    #endif
    
    if (src & SYS_RSTSTS_PORF_Msk) {
        SYS_ClearResetSrc(SYS_RSTSTS_PORF_Msk);
        
        printf("power on from POR\r\n");
        return FALSE;
    }    
    else if (src & SYS_RSTSTS_PINRF_Msk)
    {
        SYS_ClearResetSrc(SYS_RSTSTS_PINRF_Msk);
        
        printf("power on from nRESET pin\r\n");
        return FALSE;
    } 
    else if (src & SYS_RSTSTS_WDTRF_Msk)
    {
        SYS_ClearResetSrc(SYS_RSTSTS_WDTRF_Msk);
        
        printf("power on from WDT Reset\r\n");
        return FALSE;
    }    
    else if (src & SYS_RSTSTS_LVRF_Msk)
    {
        SYS_ClearResetSrc(SYS_RSTSTS_LVRF_Msk);
        
        printf("power on from LVR Reset\r\n");
        return FALSE;
    }    
    else if (src & SYS_RSTSTS_BODRF_Msk)
    {
        SYS_ClearResetSrc(SYS_RSTSTS_BODRF_Msk);
        
