released/M031BSP_INT_PWM_ADC_KEILv5/SampleCode/Template/main.c
    CLK_EnableModuleClock(TMR1_MODULE);
  	CLK_SetModuleClock(TMR1_MODULE, CLK_CLKSEL1_TMR1SEL_HIRC, 0);
    
	/***********************************/
    CLK_EnableModuleClock(UART0_MODULE);
    CLK_SetModuleClock(UART0_MODULE, CLK_CLKSEL1_UART0SEL_HIRC, CLK_CLKDIV0_UART0(1));
	
    /* Set PB multi-function pins for UART0 RXD=PB.12 and TXD=PB.13 */
    SYS->GPB_MFPH = (SYS->GPB_MFPH & ~(SYS_GPB_MFPH_PB12MFP_Msk | SYS_GPB_MFPH_PB13MFP_Msk)) |
                    (SYS_GPB_MFPH_PB12MFP_UART0_RXD | SYS_GPB_MFPH_PB13MFP_UART0_TXD);

	/***********************************/

    CLK_EnableModuleClock(ADC_MODULE);	
    CLK_SetModuleClock(ADC_MODULE, CLK_CLKSEL2_ADCSEL_PCLK1, CLK_CLKDIV0_ADC(3));

    SYS->GPB_MFPL = (SYS->GPB_MFPL &~(SYS_GPB_MFPL_PB6MFP_Msk | SYS_GPB_MFPL_PB7MFP_Msk)) \
                    | (SYS_GPB_MFPL_PB6MFP_ADC0_CH6 | SYS_GPB_MFPL_PB7MFP_ADC0_CH7) ;

    /* Set to input mode */
    GPIO_SetMode(PB, BIT6|BIT7, GPIO_MODE_INPUT);

    /* Disable the GPIO digital input path to avoid the leakage current. */
    GPIO_DISABLE_DIGITAL_PATH(PB, BIT6|BIT7);

	/***********************************/
    CLK_EnableModuleClock(TMR3_MODULE);
    CLK_SetModuleClock(TMR3_MODULE, CLK_CLKSEL1_TMR3SEL_HIRC, 0);
    
    SYS->GPA_MFPH = (SYS->GPA_MFPH & ~(SYS_GPA_MFPH_PA8MFP_Msk )) |
                    (SYS_GPA_MFPH_PA8MFP_TM3_EXT);

	/***********************************/
    CLK_EnableModuleClock(PWM1_MODULE);
    CLK_SetModuleClock(PWM1_MODULE, CLK_CLKSEL2_PWM1SEL_PCLK1, 0);
    SYS_ResetModule(PWM1_RST);

    /* Set PC multi-function pins for PWM0 Channel 0~5 */
    SYS->GPC_MFPL = (SYS->GPC_MFPL & ~(SYS_GPC_MFPL_PC5MFP_Msk)) |
                    (SYS_GPC_MFPL_PC5MFP_PWM1_CH0 );
	/***********************************/
    /* Set PB multi-function pin for EINT0(PB.5) */
    SYS->GPB_MFPL = (SYS->GPB_MFPL & ~(SYS_GPB_MFPL_PB5MFP_Msk)) |
                    (SYS_GPB_MFPL_PB5MFP_INT0);

	/***********************************/
    CLK_EnableModuleClock(PWM0_MODULE);
    CLK_SetModuleClock(PWM0_MODULE, CLK_CLKSEL2_PWM0SEL_PCLK0, 0);
    SYS_ResetModule(PWM0_RST);

    /* Set PC multi-function pins for PWM0 Channel 0~5 */
    SYS->GPA_MFPL = (SYS->GPA_MFPL & ~(SYS_GPA_MFPL_PA5MFP_Msk)) |
                    (SYS_GPA_MFPL_PA5MFP_PWM0_CH0 );

	/***********************************/
    CLK_EnableModuleClock(TMR2_MODULE);
    CLK_SetModuleClock(TMR2_MODULE, CLK_CLKSEL1_TMR2SEL_HIRC, 0);
        
    SYS->GPA_MFPL = (SYS->GPA_MFPL & ~(SYS_GPA_MFPL_PA7MFP_Msk)) |
                    (SYS_GPA_MFPL_PA7MFP_TM2 );

	/***********************************/
		
   /* Update System Core Clock */
    SystemCoreClockUpdate();

    /* Lock protected registers */
    SYS_LockReg();
}

/*
 * This is a template project for M031 series MCU. Users could based on this project to create their
 * own application without worry about the IAR/Keil project settings.
 *
 * This template application uses external crystal as HCLK source and configures UART0 to print out
 * "Hello World", users may need to do extra system configuration based on their system design.
 */

int main()
{
    SYS_Init();

    /*
        PB.12:UART0_RX
        PB.13:UART0_TX

        PB.14:GPIO(LED)
        PB.15:GPIO
    */
	GPIO_Init();
	UART0_Init();
	TIMER1_Init();
    check_reset_source();

    SysTick_enable(1000);
    #if defined (ENABLE_TICK_EVENT)
    TickSetTickEvent(1000, TickCallback_processA);  // 1000 ms
    TickSetTickEvent(5000, TickCallback_processB);  // 5000 ms
    #endif

    /*
        PB.6:ADC0_CH6
        PB.7:ADC0_CH7
    */
	ADC_ReadAVdd();
	ADC_Process(State_avergage);

    /*
        app_eint_capture.c
        PA5:PWM0_CH0 , for emulate singal OUTPUT       
        role#1 - PWM output with 100Hz , 120Hz@15% duty
            - connect to PB5:EINT0

        PB5:EINT0 , to detect input pulse (100Hz , 120Hz)

        Scenario :
        1. use INT pin , to detect input pulse (use PWM @ 100Hz , 120Hz , 15%duty)
        2. during INT pin low period : outout PWM 18K , duty changeable (duty prefer 1000 STEPs)
            - LOW : output PWM
            - HIGH : PWM off    
            - PC5:PWM1_CH0 , output freq : 18K , duty changeable
    */
   PWM_CH_Init();
   EINT_Init();
   
    // emulate signal input
    EMULATE_SIGNAL_INPUT_LOW_SPEED_100HZ();
    // EMULATE_SIGNAL_INPUT_LOW_SPEED_120HZ();
    EMULATE_SIGNAL_INPUT_HIGH_SPEED(APP_EMU_RPM_MIN);

    /*
        app_rpm_capture.c
        PA7:TM2 , for emulate singal OUTPUT
        role#1 - PWM output with 1.8K@50% duty(as 100rpm),13.5K@50% duty(as 750rpm)
            - connect to PA8:TIM3_EXT

        PA8 : TIM3_EXT , for TIMER EXTERNAL CAPTURE INPUT , to calculate rpm 
        ex : 
            max : 72 * 750 * 15 / min = 750 rpm
            min : 72 * 100 * 15 / min = 100 rpm    
    */
    RPM_Capture_Init();

    TimerService_Init();    
    TimerService_CreateTask();


    /* Got no where to go, just loop forever */
    while(1)
    {
        loop();

    }
}

/*** (C) COPYRIGHT 2017 Nuvoton Technology Corp. ***/
